# IsUniform Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLoad..::..IsUniform Property
LineLoad Class See Also
---
Indicates if the load is uniform.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsUniform { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsUniform As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsUniform {
	bool get ();
}
```

# Remarks
Returns true if the line load is uniform, false otherwise. Load is uniform when force and moment vectors assigned to the start and the end point of load are equal.
# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace